import { createGameplayCatalog, type GameplayCatalogDocument } from "../catalog.ts";

export function createCatalog(): GameplayCatalogDocument {
  return createGameplayCatalog([
    {
      "?xml": [{ "#text": "" }],
      ":@": { "version": "1.0", "encoding": "UTF-8", "standalone": "no" },
    },
    {
      "database": [
        { "#text": "\n  " },
        {
          "Group": [
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": { "what": "loading成功，进入游戏", "id": "4000001", "item": "5" },
            },
            { "#text": "\n    " },
            { "ItemSpec": [], ":@": { "what": "选择跳过新手剧情", "id": "4000005", "item": "6" } },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "——————【新版：新手剧情】——————",
                "id": "4000187",
                "item": "3000000",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Talk：传令兵说",
                "id": "4000188",
                "item": "3401201",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Talk：传令兵说",
                "id": "4000189",
                "item": "3401202",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Talk：领主说",
                "id": "4000190",
                "item": "3401301",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Talk：领主说",
                "id": "4000191",
                "item": "3401302",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Talk：士兵说",
                "id": "4000192",
                "item": "3401501",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Talk：士兵说",
                "id": "4000193",
                "item": "3401502",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "——————【新版：升级城堡】——————",
                "id": "4000194",
                "item": "3000000",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  剧情：老国王介绍世界观&引导升级城堡",
                "id": "4000195",
                "item": "3401801",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  剧情：老国王介绍世界观&引导升级城堡",
                "id": "4000196",
                "item": "3401802",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：主界面镜头移动到城堡，引导点击城堡",
                "id": "4000197",
                "item": "3402001",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：主界面镜头移动到城堡，引导点击城堡",
                "id": "4000198",
                "item": "3402002",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：主界面，引导点击城堡下方的升级按钮",
                "id": "4000199",
                "item": "3402101",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：主界面，引导点击城堡下方的升级按钮",
                "id": "4000200",
                "item": "3402102",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：升级界面，下方的升级按钮",
                "id": "4000201",
                "item": "3402201",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：升级界面，下方的升级按钮",
                "id": "4000202",
                "item": "3402202",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "——————【新版：建造伐木场】——————",
                "id": "4000203",
                "item": "3000000",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  剧情：公主介绍需要大量木材&建造伐木场可以生成木材",
                "id": "4000204",
                "item": "3402401",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  剧情：公主介绍需要大量木材&建造伐木场可以生成木材",
                "id": "4000205",
                "item": "3402402",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Guid：主界面，找到目标地块并放大，引导点击目标地块",
                "id": "4000206",
                "item": "3402601",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Guid：主界面，找到目标地块并放大，引导点击目标地块",
                "id": "4000207",
                "item": "3402602",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Guid：转盘界面，引导点击【Build】按钮",
                "id": "4000208",
                "item": "3402801",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Guid：转盘界面，引导点击【Build】按钮",
                "id": "4000209",
                "item": "3402802",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Guid：建筑建造界面，引导点击【Build】按钮",
                "id": "4000210",
                "item": "3402901",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Guid：建筑建造界面，引导点击【Build】按钮",
                "id": "4000211",
                "item": "3402902",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "——————【新版：建造马厩】——————",
                "id": "4000212",
                "item": "3000000",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Talk：建造马厩【Continue】",
                "id": "4000213",
                "item": "3403101",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Talk：建造马厩【Continue】",
                "id": "4000214",
                "item": "3403102",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Guid：主界面，找到目标地块并放大，引导点击目标地块",
                "id": "4000215",
                "item": "3403301",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Guid：主界面，找到目标地块并放大，引导点击目标地块",
                "id": "4000216",
                "item": "3403302",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Guid：转盘界面，引导点击【Build】按钮",
                "id": "4000217",
                "item": "3403401",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Guid：转盘界面，引导点击【Build】按钮",
                "id": "4000218",
                "item": "3403402",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  Guid：建筑建造界面，引导点击【Build】按钮",
                "id": "4000219",
                "item": "3403501",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  Guid：建筑建造界面，引导点击【Build】按钮",
                "id": "4000220",
                "item": "3403502",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "——————【新版：训练骑兵】——————",
                "id": "4000221",
                "item": "3000000",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  剧情：兵营建造完毕，我们可以建造属于我们自己的军队了",
                "id": "4000222",
                "item": "3403701",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  剧情：兵营建造完毕，我们可以建造属于我们自己的军队了",
                "id": "4000223",
                "item": "3403702",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：主界面，找到兵营并放大，引导点击兵营",
                "id": "4000224",
                "item": "3403801",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：主界面，找到兵营并放大，引导点击兵营",
                "id": "4000225",
                "item": "3403802",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：主界面，引导点击兵营下方的造兵按钮",
                "id": "4000226",
                "item": "3403901",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：主界面，引导点击兵营下方的造兵按钮",
                "id": "4000227",
                "item": "3403902",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：兵营转盘界面，引导点击【训练】按钮",
                "id": "4000228",
                "item": "3404001",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：兵营转盘界面，引导点击【训练】按钮",
                "id": "4000229",
                "item": "3404002",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "——————【新版：领取奖励】——————",
                "id": "4000230",
                "item": "3000000",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：主界面，找到兵营并放大，引导点击收兵按钮",
                "id": "4000231",
                "item": "3404201",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：主界面，找到兵营并放大，引导点击收兵按钮",
                "id": "4000232",
                "item": "3404202",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：主界面，引导点击【quest】按钮",
                "id": "4000233",
                "item": "3404301",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：主界面，引导点击【quest】按钮",
                "id": "4000234",
                "item": "3404302",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：任务界面，引导点击第一个【Reward】按钮",
                "id": "4000235",
                "item": "3404401",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：任务界面，引导点击第一个【Reward】按钮",
                "id": "4000236",
                "item": "3404402",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：任务界面，引导点击【后退】按钮",
                "id": "4000237",
                "item": "3404601",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：任务界面，引导点击【后退】按钮",
                "id": "4000238",
                "item": "3404602",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "——————【引导世界探险】——————————",
                "id": "4000062",
                "item": "3000000",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见 剧情：我们有足够的部队了，可以去世界探险了",
                "id": "4000063",
                "item": "3030101",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击 剧情：我们有足够的部队了，可以去世界探险了",
                "id": "4000064",
                "item": "3030102",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见 引导：主界面，引导点击主界面的【世界】按钮",
                "id": "4000065",
                "item": "3030201",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击 引导：主界面，引导点击主界面的【世界】按钮",
                "id": "4000066",
                "item": "3030202",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见 剧情：三队列首领说话",
                "id": "4000067",
                "item": "3031301",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击 剧情：三队列首领说话",
                "id": "4000068",
                "item": "3031302",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见 剧情：领主说",
                "id": "4000069",
                "item": "3031401",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击 剧情：领主说",
                "id": "4000070",
                "item": "3031402",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  剧情：发现怪物",
                "id": "4000240",
                "item": "3405001",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  剧情：发现怪物",
                "id": "4000241",
                "item": "3405002",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  提示：世界地图界面，点击怪物",
                "id": "4000242",
                "item": "3405101",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  提示：世界地图界面，点击怪物",
                "id": "4000243",
                "item": "3405102",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：怪物界面，引导点击【Attack】按钮",
                "id": "4000244",
                "item": "3405201",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：怪物界面，引导点击【Attack】按钮",
                "id": "4000245",
                "item": "3405202",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：出征界面，引导点击【Attack】按钮",
                "id": "4000246",
                "item": "3405301",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：出征界面，引导点击【Attack】按钮",
                "id": "4000247",
                "item": "3405302",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  剧情：回到主城",
                "id": "4000248",
                "item": "3405501",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  剧情：回到主城",
                "id": "4000249",
                "item": "3405502",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "看见  引导：世界地图界面，引导点击回主城按钮",
                "id": "4000250",
                "item": "3405601",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "点击  引导：世界地图界面，引导点击回主城按钮",
                "id": "4000251",
                "item": "3405602",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：公主介绍升级瞭望台",
                "id": "4000252",
                "item": "3405701",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：公主介绍升级瞭望台",
                "id": "4000253",
                "item": "3405702",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面镜头移动到城堡，引导点击城堡",
                "id": "4000254",
                "item": "3405801",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面镜头移动到城堡，引导点击城堡",
                "id": "4000255",
                "item": "3405802",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面，引导点击城堡下方的升级按钮",
                "id": "4000256",
                "item": "3405901",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面，引导点击城堡下方的升级按钮",
                "id": "4000257",
                "item": "3405902",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：升级界面，下方的升级按钮",
                "id": "4000258",
                "item": "3406001",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：升级界面，下方的升级按钮",
                "id": "4000259",
                "item": "3406002",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：发现有敌情，有敌人正在向我们的城堡行军",
                "id": "4000260",
                "item": "3406201",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：发现有敌情，有敌人正在向我们的城堡行军",
                "id": "4000261",
                "item": "3406202",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面，引导点击主界面的【世界】按钮",
                "id": "4000262",
                "item": "3406301",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面，引导点击主界面的【世界】按钮",
                "id": "4000263",
                "item": "3406302",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：有红线表名有敌人在向你行军",
                "id": "4000264",
                "item": "3406401",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：有红线表名有敌人在向你行军",
                "id": "4000265",
                "item": "3406402",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "镜头移动到怪物那里",
                "id": "4000266",
                "item": "3406501",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "镜头移动到怪物那里",
                "id": "4000267",
                "item": "3406502",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：回城市布置防御",
                "id": "4000268",
                "item": "3406601",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：回城市布置防御",
                "id": "4000269",
                "item": "3406602",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：世界地图界面，引导点击回主城按钮",
                "id": "4000270",
                "item": "3406701",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：世界地图界面，引导点击回主城按钮",
                "id": "4000271",
                "item": "3406702",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "Talk：建造战争堡垒【Continue】",
                "id": "4000272",
                "item": "3406801",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "Talk：建造战争堡垒【Continue】",
                "id": "4000273",
                "item": "3406802",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "Guid：主界面，找到目标地块并放大，引导点击目标地块",
                "id": "4000274",
                "item": "3407001",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "Guid：主界面，找到目标地块并放大，引导点击目标地块",
                "id": "4000275",
                "item": "3407002",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "Guid：转盘界面，引导点击【Build】按钮",
                "id": "4000276",
                "item": "3407101",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "Guid：转盘界面，引导点击【Build】按钮",
                "id": "4000277",
                "item": "3407102",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "Guid：建筑建造界面，引导点击【Build】按钮",
                "id": "4000278",
                "item": "3407201",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "Guid：建筑建造界面，引导点击【Build】按钮",
                "id": "4000279",
                "item": "3407202",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：战争建造完毕，我们可以建造陷阱了",
                "id": "4000280",
                "item": "3407401",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：战争建造完毕，我们可以建造陷阱了",
                "id": "4000281",
                "item": "3407402",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面，找到战争堡垒并放大，引导点击战争堡垒",
                "id": "4000282",
                "item": "3407501",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面，找到战争堡垒并放大，引导点击战争堡垒",
                "id": "4000283",
                "item": "3407502",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面，引导点击战争堡垒下方的造陷阱按钮",
                "id": "4000284",
                "item": "3407601",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：主界面，引导点击战争堡垒下方的造陷阱按钮",
                "id": "4000285",
                "item": "3407602",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：战争堡垒转盘界面，引导点击【训练】按钮",
                "id": "4000286",
                "item": "3407701",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：战争堡垒转盘界面，引导点击【训练】按钮",
                "id": "4000287",
                "item": "3407702",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": { "what": "引导：收陷阱", "id": "4000288", "item": "3407901", "doing": "看见" },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": { "what": "引导：收陷阱", "id": "4000289", "item": "3407902", "doing": "点击" },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：去世界组织防御",
                "id": "4000290",
                "item": "3408001",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：去世界组织防御",
                "id": "4000291",
                "item": "3408002",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：点击去世界",
                "id": "4000292",
                "item": "3408101",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：点击去世界",
                "id": "4000293",
                "item": "3408102",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "动画：怪物攻城",
                "id": "4000294",
                "item": "3408201",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "动画：怪物攻城",
                "id": "4000295",
                "item": "3408202",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：勇士们加油",
                "id": "4000296",
                "item": "3408301",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：勇士们加油",
                "id": "4000297",
                "item": "3408302",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "动画：消灭怪物",
                "id": "4000298",
                "item": "3408401",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "动画：消灭怪物",
                "id": "4000299",
                "item": "3408402",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：防御成功，获得龙蛋",
                "id": "4000300",
                "item": "3408501",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "剧情：防御成功，获得龙蛋",
                "id": "4000301",
                "item": "3408502",
                "doing": "点击",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：回到主城，查看龙蛋",
                "id": "4000302",
                "item": "3408601",
                "doing": "看见",
              },
            },
            { "#text": "\n    " },
            {
              "ItemSpec": [],
              ":@": {
                "what": "引导：回到主城，查看龙蛋",
                "id": "4000303",
                "item": "3408602",
                "doing": "点击",
              },
            },
            { "#text": "\n  " },
          ],
          ":@": { "id": "Market" },
        },
        { "#text": "\n" },
      ],
    },
  ]);
}
